renesas/rx-driver-package/source/r_tsip_rx_lib/r_tsip_rx_vx.xx/r_tsip_rx/src/targets/rx65n/r_tsip_rx_private.h
e_tsip_err_t R_TSIP_Sha1HmacGenerateInitPrivate(tsip_hmac_sha_handle_t *handle, tsip_hmac_sha_key_index_t *key_index);
e_tsip_err_t R_TSIP_Sha1HmacGenerateUpdatePrivate(tsip_hmac_sha_handle_t *handle, uint32_t *InData_PaddedMsg,
        uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Sha1HmacGenerateFinalPrivate(tsip_hmac_sha_handle_t *handle, uint32_t *OutData_Mac);
e_tsip_err_t R_TSIP_Sha1HmacVerifyInitPrivate(tsip_hmac_sha_handle_t *handle, tsip_hmac_sha_key_index_t *key_index);
e_tsip_err_t R_TSIP_Sha1HmacVerifyUpdatePrivate(tsip_hmac_sha_handle_t *handle, uint32_t *InData_PaddedMsg,
        uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Sha1HmacVerifyFinalPrivate(tsip_hmac_sha_handle_t *handle, uint32_t *InData_Mac,
        uint32_t *InData_length);
e_tsip_err_t R_TSIP_Sha256HmacGenerateInitPrivate(tsip_hmac_sha_handle_t *handle,
        tsip_hmac_sha_key_index_t *key_index);
e_tsip_err_t R_TSIP_Sha256HmacGenerateUpdatePrivate(tsip_hmac_sha_handle_t *handle, uint32_t *InData_PaddedMsg,
        uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Sha256HmacGenerateFinalPrivate(tsip_hmac_sha_handle_t *handle, uint32_t *OutData_Mac);
e_tsip_err_t R_TSIP_Sha256HmacVerifyInitPrivate(tsip_hmac_sha_handle_t *handle, tsip_hmac_sha_key_index_t *key_index);
e_tsip_err_t R_TSIP_Sha256HmacVerifyUpdatePrivate(tsip_hmac_sha_handle_t *handle, uint32_t *InData_PaddedMsg,
        uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Sha256HmacVerifyFinalPrivate(tsip_hmac_sha_handle_t *handle, uint32_t *InData_Mac,
        uint32_t *InData_length);

e_tsip_err_t R_TSIP_Rsa1024ModularExponentEncryptPrivate(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa1024ModularExponentDecryptPrivate(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048ModularExponentEncryptPrivate(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048ModularExponentDecryptPrivate(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa3072ModularExponentEncryptPrivate(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa4096ModularExponentEncryptPrivate(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048DhKeyAgreementPrivate(uint32_t *InData_KeyIndex, uint32_t *InData_PrimNumIndex,
        uint32_t *InData_Message, uint32_t *InData_ModExp, uint32_t *OutData_ModExp);

e_tsip_err_t R_TSIP_TdesEcbEncryptInitPrivate(tsip_tdes_key_index_t *key_index);
e_tsip_err_t R_TSIP_TdesEcbEncryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_TdesEcbEncryptFinalPrivate(void);
e_tsip_err_t R_TSIP_TdesEcbDecryptInitPrivate(tsip_tdes_key_index_t *key_index);
e_tsip_err_t R_TSIP_TdesEcbDecryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_TdesEcbDecryptFinalPrivate(void);
e_tsip_err_t R_TSIP_TdesCbcEncryptInitPrivate(tsip_tdes_key_index_t *key_index, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_TdesCbcEncryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_TdesCbcEncryptFinalPrivate(void);
e_tsip_err_t R_TSIP_TdesCbcDecryptInitPrivate(tsip_tdes_key_index_t *key_index, uint32_t *InData_IV);
e_tsip_err_t R_TSIP_TdesCbcDecryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_TdesCbcDecryptFinalPrivate(void);

e_tsip_err_t R_TSIP_Arc4EncryptInitPrivate(tsip_arc4_key_index_t *key_index);
e_tsip_err_t R_TSIP_Arc4EncryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Arc4EncryptFinalPrivate(void);
e_tsip_err_t R_TSIP_Arc4DecryptInitPrivate(tsip_arc4_key_index_t *key_index);
e_tsip_err_t R_TSIP_Arc4DecryptUpdatePrivate(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Arc4DecryptFinalPrivate(void);

e_tsip_err_t R_TSIP_EcdhReadPublicKeyPrivate(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex, uint32_t *InData_data,
        uint32_t *InData_Signature, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_EcdhMakePublicKeyPrivate(uint32_t *InData_Cmd, uint32_t *InData_KeyType,
        uint32_t *InData_PubKeyIndex, uint32_t *InData_PrivKeyIndex, uint32_t *InData_key_id, uint32_t *OutData_data,
        uint32_t *OutData_Signature, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_EcdhCalculateSharedSecretIndexPrivate(uint32_t *InData_KeyType, uint32_t *InData_PubKeyIndex,
        uint32_t *InData_PrivKeyIndex, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_EcdhKeyDerivationPrivate(uint32_t *InData_KeyIndexType, uint32_t *InData_KeyIndex,
        uint32_t *InData_KDFType, uint32_t *InData_PaddedMsg, uint32_t MAX_CNT, uint32_t *InData_SaltKeyIndex,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_EcdheP512KeyAgreementPrivate(uint32_t *InData_KeyIndex, uint32_t *InData_PubKey,
        uint32_t *OutData_PubKey);


/* --------------------- TSIP control procedure related ---------------------- */

void         R_TSIP_SoftwareResetSub(void);
e_tsip_err_t R_TSIP_SelfCheck1Sub(void);
e_tsip_err_t R_TSIP_SelfCheck2Sub(void);

e_tsip_err_t R_TSIP_GenerateAes128KeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateAes256KeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateAes128RandomKeyIndexSub(uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateAes256RandomKeyIndexSub(uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateTdesKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateArc4KeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateTdesRandomKeyIndexSub(uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateArc4RandomKeyIndexSub(uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateRsa1024PublicKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateRsa1024PrivateKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateRsa2048PublicKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateRsa2048PrivateKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateRsa3072PublicKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateRsa4096PublicKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateRsa1024RandomKeyIndexSub(uint32_t MAX_CNT, uint32_t *OutData_PubKeyIndex,
        uint32_t *OutData_PrivKeyIndex);
e_tsip_err_t R_TSIP_GenerateRsa2048RandomKeyIndexSub(uint32_t MAX_CNT, uint32_t *OutData_PubKeyIndex,
        uint32_t *OutData_PrivKeyIndex);
e_tsip_err_t R_TSIP_GenerateTlsRsaInstallDataSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_InstData);
e_tsip_err_t R_TSIP_GenerateTlsP256EccKeyIndexSub(uint32_t *OutData_KeyIndex, uint32_t *OutData_PubKey);
e_tsip_err_t R_TSIP_GenerateEccPrivateKeyIndexSub(uint32_t *InData_SharedKeyIndex,
        uint32_t *InData_SessionKey, uint32_t *InData_Cmd, uint32_t *InData_IV,
        uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateEccP384PrivateKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateEccPublicKeyIndexSub(uint32_t *InData_SharedKeyIndex,
        uint32_t *InData_SessionKey, uint32_t *InData_Cmd, uint32_t *InData_IV, uint32_t *InData_InstData,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateEccP384PublicKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateEccRandomKeyIndexSub(uint32_t *InData_Cmd, uint32_t *OutData_PubKeyIndex,
        uint32_t *OutData_PrivKeyIndex);
e_tsip_err_t R_TSIP_GenerateEccP384RandomKeyIndexSub(uint32_t *OutData_PubKeyIndex, uint32_t *OutData_PrivKeyIndex);
e_tsip_err_t R_TSIP_GenerateShaHmacKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_Cmd, uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_GenerateRandomNumberSub(uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_GenerateUpdateKeyRingKeyIndexSub(uint32_t *InData_SharedKeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_InstData);

e_tsip_err_t R_TSIP_UpdateAes128KeyIndexSub(uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateAes256KeyIndexSub(uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateTdesKeyIndexSub(uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateArc4KeyIndexSub(uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateRsa1024PublicKeyIndexSub(uint32_t *InData_IV, uint32_t *InData_InstData,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateRsa1024PrivateKeyIndexSub(uint32_t *InData_IV, uint32_t *InData_InstData,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateRsa2048PublicKeyIndexSub(uint32_t *InData_IV, uint32_t *InData_InstData,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateRsa2048PrivateKeyIndexSub(uint32_t *InData_IV, uint32_t *InData_InstData,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateRsa3072PublicKeyIndexSub(uint32_t *InData_IV, uint32_t *InData_InstData,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateRsa4096PublicKeyIndexSub(uint32_t *InData_IV, uint32_t *InData_InstData,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateTlsRsaDataSub(uint32_t *InData_IV, uint32_t *InData_InstData, uint32_t *OutData_InstData);
e_tsip_err_t R_TSIP_UpdateEccPrivateKeyIndexSub(uint32_t *InData_Cmd, uint32_t *InData_IV,
        uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateEccP384PrivateKeyIndexSub(uint32_t *InData_IV,
        uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateEccPublicKeyIndexSub(uint32_t *InData_Cmd, uint32_t *InData_IV,
        uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateEccP384PublicKeyIndexSub(uint32_t *InData_IV,
        uint32_t *InData_InstData, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_UpdateShaHmacKeyIndexSub(uint32_t *InData_Cmd, uint32_t *InData_IV, uint32_t *InData_InstData,
        uint32_t *OutData_KeyIndex);

e_tsip_err_t R_TSIP_StartUpdateFirmwareSub(void);
e_tsip_err_t R_TSIP_GenerateFirmwareMacSub(uint32_t *InData_KeyIndex, uint32_t *InData_SessionKey,
        uint32_t *InData_UpProgram, uint32_t *InData_IV, uint32_t *OutData_Program, uint32_t MAX_CNT,
        tsip_firmware_generate_mac_resume_handle_t *tsip_firmware_generate_mac_resume_handle);
e_tsip_err_t R_TSIP_VerifyFirmwareMacSub(uint32_t *InData_Program, uint32_t MAX_CNT);

e_tsip_err_t R_TSIP_Aes128EncryptDecryptInitSub(uint32_t *InData_KeyType, uint32_t *InData_Cmd,
        uint32_t *InData_KeyIndex, uint32_t *InData_IV);
void         R_TSIP_Aes128EncryptDecryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128EncryptDecryptFinalSub(void);
e_tsip_err_t R_TSIP_Aes256EncryptDecryptInitSub(uint32_t *InData_KeyType, uint32_t *InData_Cmd,
        uint32_t *InData_KeyIndex, uint32_t *InData_IV);
void         R_TSIP_Aes256EncryptDecryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256EncryptDecryptFinalSub(void);

e_tsip_err_t R_TSIP_Ghash(uint32_t *InData_HV, uint32_t *InData_IV, uint32_t *InData_Text, uint32_t *OutData_DataT,
        uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128GcmEncryptInitSub(uint32_t *InData_KeyType, uint32_t *InData_DataType, uint32_t *InData_Cmd,
        uint32_t *InData_KeyIndex, uint32_t *InData_IV, uint32_t *InData_SeqNum);
void         R_TSIP_Aes128GcmEncryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128GcmEncryptFinalSub(uint32_t *InData_Text, uint32_t *InData_DataALen,
        uint32_t *InData_TextLen, uint32_t *OutData_Text, uint32_t *OutData_DataT);
e_tsip_err_t R_TSIP_Aes128GcmDecryptInitSub(uint32_t *InData_KeyType, uint32_t *InData_DataType, uint32_t *InData_Cmd,
        uint32_t *InData_KeyIndex, uint32_t *InData_IV, uint32_t *InData_SeqNum);
void         R_TSIP_Aes128GcmDecryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128GcmDecryptFinalSub(uint32_t *InData_Text, uint32_t *InData_DataT, uint32_t *InData_DataALen,
        uint32_t *InData_TextLen, uint32_t *InData_DataTLen, uint32_t *OutData_Text);
void         R_TSIP_Aes128GcmDecryptUpdateTransitionSub(void);
void         R_TSIP_Aes128GcmEncryptUpdateTransitionSub(void);
void         R_TSIP_Aes256GcmDecryptUpdateTransitionSub(void);
void         R_TSIP_Aes256GcmEncryptUpdateTransitionSub(void);
void         R_TSIP_Aes128GcmEncryptUpdateAADSub(uint32_t *InData_DataA, uint32_t MAX_CNT);
void         R_TSIP_Aes128GcmDecryptUpdateAADSub(uint32_t *InData_DataA, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256GcmEncryptInitSub(uint32_t *InData_KeyType, uint32_t *InData_KeyIndex, uint32_t *InData_IV);
void         R_TSIP_Aes256GcmEncryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256GcmEncryptFinalSub(uint32_t *InData_Text, uint32_t *InData_DataALen,
        uint32_t *InData_TextLen, uint32_t *OutData_Text, uint32_t *OutData_DataT);
e_tsip_err_t R_TSIP_Aes256GcmDecryptInitSub(uint32_t *InData_KeyType, uint32_t *InData_KeyIndex, uint32_t *InData_IV);
void         R_TSIP_Aes256GcmDecryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256GcmDecryptFinalSub(uint32_t *InData_Text, uint32_t *InData_DataT,
        uint32_t *InData_DataALen, uint32_t *InData_TextLen, uint32_t *InData_DataTLen, uint32_t *OutData_Text);
void         R_TSIP_Aes256GcmEncryptUpdateAADSub(uint32_t *InData_DataA, uint32_t MAX_CNT);
void         R_TSIP_Aes256GcmDecryptUpdateAADSub(uint32_t *InData_DataA, uint32_t MAX_CNT);

e_tsip_err_t R_TSIP_Aes128CcmEncryptInitSub(uint32_t *InData_KeyType, uint32_t *InData_DataType, uint32_t *InData_Cmd,
        uint32_t *InData_TextLen, uint32_t *InData_KeyIndex, uint32_t *InData_IV, uint32_t *InData_Header,
        uint32_t Header_Len, uint32_t *InData_SeqNum);
void R_TSIP_Aes128CcmEncryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128CcmEncryptFinalSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t *OutData_MAC);
e_tsip_err_t R_TSIP_Aes128CcmDecryptInitSub(uint32_t *InData_KeyType, uint32_t *InData_DataType, uint32_t *InData_Cmd,
        uint32_t *InData_TextLen, uint32_t *InData_MACLength, uint32_t *InData_KeyIndex, uint32_t *InData_IV,
        uint32_t *InData_Header, uint32_t Header_Len, uint32_t *InData_SeqNum);
void R_TSIP_Aes128CcmDecryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes128CcmDecryptFinalSub(uint32_t *InData_Text, uint32_t *InData_MAC, uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Aes256CcmEncryptInitSub(uint32_t *InData_KeyType, uint32_t *InData_KeyIndex, uint32_t *InData_IV,
        uint32_t *InData_Header, uint32_t Header_Len);
void R_TSIP_Aes256CcmEncryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256CcmEncryptFinalSub(uint32_t *InData_TextLen, uint32_t *InData_Text, uint32_t *OutData_Text,
        uint32_t *OutData_MAC);
e_tsip_err_t R_TSIP_Aes256CcmDecryptInitSub(uint32_t *InData_KeyType, uint32_t *InData_KeyIndex, uint32_t *InData_IV,
        uint32_t *InData_Header, uint32_t Header_Len);
void R_TSIP_Aes256CcmDecryptUpdateSub(uint32_t *InData_Text, uint32_t *OutData_Text, uint32_t MAX_CNT);
e_tsip_err_t R_TSIP_Aes256CcmDecryptFinalSub(uint32_t *InData_Text, uint32_t *InData_TextLen, uint32_t *InData_MAC,
        uint32_t *InData_MACLength, uint32_t *OutData_Text);

