renesas/rx-driver-package/source/r_tsip_rx_lib/r_tsip_rx_vx.xx/r_tsip_rx/src/targets/rx65n/r_tsip_rx_private.h
e_tsip_err_t R_TSIP_GenerateTls13P256EccKeyIndexSub(uint32_t * InData_Cmd, uint32_t * InData_Handle,
        uint32_t * OutData_KeyIndex, uint32_t * OutData_PubKey);
e_tsip_err_t R_TSIP_Tls13GenerateEcdheSharedSecretSub(uint32_t * InData_Cmd, uint32_t * InData_PubKey,
        uint32_t * InData_KeyIndex, uint32_t * OutData_SharedSecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateHandshakeSecretSub(uint32_t * InData_SharedSecretKeyIndex,
        uint32_t * OutData_Handshake_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateServerHandshakeTrafficKeySub(uint32_t * InData_Cmd,
        uint32_t * InData_Handshake_SecretKeyIndex, uint32_t * InData_MsgHash,
        uint32_t * OutData_ServerWriteKeyIndex, uint32_t * OutData_ServerFinishedKeyIndex);
e_tsip_err_t R_TSIP_Tls13ServerHandshakeVerificationSub(uint32_t * InData_Cmd,
        uint32_t * InData_ServerFinishedKeyIndex, uint32_t * InData_MsgHash, uint32_t * InData_ServerFinished,
        uint32_t * OutData_VerifyDataIndex);
e_tsip_err_t R_TSIP_Tls13GenerateClientHandshakeTrafficKeySub(uint32_t * InData_Cmd,
        uint32_t * InData_Handshake_SecretKeyIndex, uint32_t * InData_MsgHash, uint32_t * OutData_ClientWriteKeyIndex,
        uint32_t * OutData_ClientFinishedKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateMasterSecretSub(uint32_t * InData_Cmd, uint32_t * InData_Handshake_SecretKeyIndex,
        uint32_t * InData_VerifyDataIndex, uint32_t * OutData_Handle, uint32_t * OutData_Master_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateApplicationTrafficKeySub(uint32_t * InData_Cmd, uint32_t * InData_Handle,
        uint32_t * InData_Master_SecretKeyIndex, uint32_t * InData_MsgHash,
        uint32_t * OutData_ServerApplicationSecretKeyIndex, uint32_t * OutData_ClientApplicationSecretKeyIndex,
        uint32_t * OutData_ServerWriteKeyIndex, uint32_t * OutData_ClientWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13UpdateApplicationTrafficKeySub(uint32_t * InData_Cmd, uint32_t * InData_UpdateKeyType,
        uint32_t * InData_Handle, uint32_t * InData_ApplicationSecretKeyIndex,
        uint32_t * OutData_ApplicationSecretKeyIndex, uint32_t * OutData_ApplicationWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateResumptionMasterSecretSub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *InData_Master_SecretKeyIndex, uint32_t *InData_MsgHash, uint32_t *OutData_RMaster_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13GeneratePreSharedKeySub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *InData_RMaster_SecretKeyIndex, uint32_t *InData_TicketNonceLen, uint32_t *InData_TicketNonce,
        uint32_t *OutData_PreSharedKeyIndex);
e_tsip_err_t R_TSIP_Tls13GeneratePskBinderKeySub(uint32_t *InData_Handle, uint32_t *InData_PreSharedKeyIndex,
        uint32_t *OutData_BinderKeyIndex);
e_tsip_err_t R_TSIP_Tls13Generate0RttApplicationWriteKeySub(uint32_t *InData_Handle, uint32_t *InData_PreSharedKeyIndex,
        uint32_t *InData_MsgHash, uint32_t *OutData_ClientWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13GenerateResumptionHandshakeSecretSub(uint32_t *InData_Handle,
        uint32_t *InData_SharedSecretKeyIndexType, uint32_t *InData_PreSharedKeyIndex,
        uint32_t *InData_SharedSecretKeyIndex, uint32_t *OutData_Handshake_SecretKeyIndex);
e_tsip_err_t R_TSIP_GenerateTls13SVP256EccKeyIndexSub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *OutData_KeyIndex, uint32_t *OutData_PubKey);
e_tsip_err_t R_TSIP_Tls13SVGenerateEcdheSharedSecretSub(uint32_t *InData_Cmd, uint32_t *InData_PubKey,
        uint32_t *InData_KeyIndex, uint32_t *OutData_SharedSecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateHandshakeSecretSub(uint32_t *InData_SharedSecretKeyIndex,
        uint32_t *OutData_Handshake_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateServerHandshakeTrafficKeySub(uint32_t *InData_Cmd,
        uint32_t *InData_Handshake_SecretKeyIndex, uint32_t *InData_MsgHash, uint32_t *OutData_ServerWriteKeyIndex,
        uint32_t *OutData_ServerFinishedKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVClientHandshakeVerificationSub(uint32_t *InData_Cmd, uint32_t *InData_ClientFinishedKeyIndex,
        uint32_t *InData_MsgHash, uint32_t *InData_ClientFinished);
e_tsip_err_t R_TSIP_Tls13SVGenerateClientHandshakeTrafficKeySub(uint32_t *InData_Cmd,
        uint32_t *InData_Handshake_SecretKeyIndex, uint32_t *InData_MsgHash, uint32_t *OutData_ClientWriteKeyIndex,
        uint32_t *OutData_ClientFinishedKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateMasterSecretSub(uint32_t *InData_Cmd, uint32_t *InData_Handshake_SecretKeyIndex,
        uint32_t *OutData_Handle, uint32_t *OutData_Master_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateApplicationTrafficKeySub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *InData_Master_SecretKeyIndex, uint32_t *InData_MsgHash,
        uint32_t *OutData_ServerApplicationSecretKeyIndex, uint32_t *OutData_ClientApplicationSecretKeyIndex,
        uint32_t *OutData_ServerWriteKeyIndex, uint32_t *OutData_ClientWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVUpdateApplicationTrafficKeySub(uint32_t *InData_Cmd, uint32_t *InData_UpdateKeyType,
        uint32_t *InData_Handle, uint32_t *InData_ApplicationSecretKeyIndex,
        uint32_t *OutData_ApplicationSecretKeyIndex, uint32_t *OutData_ApplicationWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateResumptionMasterSecretSub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *InData_Master_SecretKeyIndex, uint32_t *InData_MsgHash, uint32_t *OutData_RMaster_SecretKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGeneratePreSharedKeySub(uint32_t *InData_Cmd, uint32_t *InData_Handle,
        uint32_t *InData_RMaster_SecretKeyIndex, uint32_t *InData_TicketNonceLen, uint32_t *InData_TicketNonce,
        uint32_t *OutData_PreSharedKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGeneratePskBinderKeySub(uint32_t *InData_Handle, uint32_t *InData_PreSharedKeyIndex,
        uint32_t *OutData_BinderKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerate0RttApplicationWriteKeySub(uint32_t *InData_Handle,
        uint32_t *InData_PreSharedKeyIndex, uint32_t *InData_MsgHash, uint32_t *OutData_ClientWriteKeyIndex);
e_tsip_err_t R_TSIP_Tls13SVGenerateResumptionHandshakeSecretSub(uint32_t *InData_Handle,
        uint32_t *InData_SharedSecretKeyIndexType, uint32_t *InData_PreSharedKeyIndex,
        uint32_t *InData_SharedSecretKeyIndex, uint32_t *OutData_Handshake_SecretKeyIndex);

e_tsip_err_t R_TSIP_Rsa1024ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa1024ModularExponentDecryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048ModularExponentDecryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text,
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa3072ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text, 
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa4096ModularExponentEncryptSub(uint32_t *InData_KeyIndex, uint32_t *InData_Text, 
        uint32_t *OutData_Text);
e_tsip_err_t R_TSIP_Rsa2048DhKeyAgreementSub(uint32_t *InData_KeyIndex, uint32_t *InData_PrimNumIndex,
        uint32_t *InData_Message, uint32_t *InData_ModExp, uint32_t *OutData_ModExp);

e_tsip_err_t R_TSIP_EcdsaSigunatureGenerateSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *OutData_Signature);
e_tsip_err_t R_TSIP_EcdsaP384SigunatureGenerateSub(uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *OutData_Signature);
e_tsip_err_t R_TSIP_EcdsaSigunatureVerificationSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *InData_Signature);
e_tsip_err_t R_TSIP_EcdsaP384SigunatureVerificationSub(uint32_t *InData_KeyIndex,
        uint32_t *InData_MsgDgst, uint32_t *InData_Signature);

e_tsip_err_t R_TSIP_DlmsCosemQeuSignatureVerificationSub(uint32_t *InData_Cmd, uint32_t *InData_KeyIndex,
        uint32_t *InData_data, uint32_t *InData_Signature, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_DlmsCosemQevSignatureGenerationSub(uint32_t *InData_Cmd, uint32_t *InData_KeyType,
        uint32_t *InData_PubKeyIndex, uint32_t *InData_PrivKeyIndex, uint32_t *InData_key_id, uint32_t *OutData_data,
        uint32_t *OutData_Signature, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_DlmsCosemCalculateZSub(uint32_t *InData_KeyType, uint32_t *InData_PubKeyIndex,
        uint32_t *InData_PrivKeyIndex, uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_DlmsCosemCalculateKekSub(uint32_t *InData_KeyIndexType, uint32_t *InData_KeyIndex,
        uint32_t *InData_KDFType, uint32_t *InData_PaddedMsg, uint32_t MAX_CNT, uint32_t *InData_SaltKeyIndex,
        uint32_t *OutData_KeyIndex);
e_tsip_err_t R_TSIP_EcdheP512KeyAgreementSub(uint32_t *InData_KeyIndex, uint32_t *InData_PubKey,
        uint32_t *OutData_PubKey);

void R_TSIP_TlsRootCertificateVerificationSubSub(void);
void R_TSIP_TlsGenerateSubSub(void);

void R_TSIP_SelfCheck1SubSub(void);
void R_TSIP_SelfCheck2SubSub(void);

