renesas/rx-driver-package/source/r_tsip_rx_lib/r_tsip_rx_vx.xx/r_tsip_rx/src/targets/rx65n/r_tsip_rx_private.h
void RX65NHU_func000(uint32_t *InData_PaddedMsg, int32_t MAX_CNT);
void RX65NHU_func001(void);
void RX65NHU_func002(void);
void RX65NHU_func003(uint32_t* ARG1);
void RX65NHU_func004(uint32_t ARG1);
void RX65NHU_func005(uint32_t ARG1);
void RX65NHU_func006(void);
void RX65NHU_func007(void);
void RX65NHU_func008(void);
void RX65NHU_func009(void);
void RX65NHU_func010(uint32_t ARG1);
void RX65NHU_func011(uint32_t *ARG1);
void RX65NHU_func015(void);
void RX65NHU_func022(void);
void RX65NHU_func023(void);
void RX65NHU_func025(uint32_t ARG1);
void RX65NHU_func027(uint32_t ARG1);
void RX65NHU_func028(uint32_t ARG1);
void RX65NHU_func030(void);
void RX65NHU_func031(uint32_t *ARG1);
void RX65NHU_func032(void);
void RX65NHU_func040(uint32_t ARG1);
void RX65NHU_func041(uint32_t ARG1);
void RX65NHU_func050(uint32_t ARG1);
void RX65NHU_func051(void);
void RX65NHU_func052(uint32_t ARG1);
void RX65NHU_func053(uint32_t ARG1);
void RX65NHU_func054(uint32_t ARG1, uint32_t ARG2);
void RX65NHU_func060(void);
void RX65NHU_func061(void);
void RX65NHU_func070(void);
void RX65NHU_func071(void);
void RX65NHU_func072(void);
void RX65NHU_func073(uint32_t *ARG1);
void RX65NHU_func074(void);
void RX65NHU_func075(void);
void RX65NHU_func080(void);
void RX65NHU_func100(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void RX65NHU_func101(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void RX65NHU_func102(uint32_t ARG1, uint32_t ARG2, uint32_t ARG3, uint32_t ARG4);
void RX65NHU_func103(void);
void RX65NHU_func200(void);
void RX65NHU_func202(void);
void RX65NHU_func205(void);
void RX65NHU_func206(void);
void RX65NHU_func207(void);
void RX65NHU_func304(void);
void RX65NHU_func307(void);
void RX65NHU_func308(void);
void RX65NHU_func309(void);
void RX65NHU_func310(void);
void RX65NHU_func311(void);
void RX65NHU_func312(uint32_t ARG1);
void RX65NHU_func313(uint32_t ARG1);
void RX65NHU_func314(uint32_t ARG1);
void RX65NHU_func315(uint32_t ARG1);
void RX65NHU_func316(void);
void RX65NHU_func317(void);
void RX65NHU_func318(void);
void RX65NHU_func319(uint32_t ARG1);
void RX65NHU_func320(uint32_t ARG1);
void RX65NHU_func321(uint32_t ARG1);
void RX65NHU_func322(uint32_t ARG1);
void RX65NHU_func323(void);
void RX65NHU_func324(void);
void RX65NHU_func325(void);
void RX65NHU_func401(void);
void RX65NHU_func402(void);

void firm_mac_read(uint32_t *InData_Program);

e_tsip_err_t rsassa_emsa_pss_encode(tsip_rsa_byte_data_t *message, uint8_t hash_type, uint32_t em_bits, uint8_t *em);

/**********************************************************************************************************************
 * Function Name: change_endian_long
 * Description  : change endian
 * Arguments    : data -
 *                    input data
 * Return Value : the data changing endian
 *********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(change_endian_long)
uint32_t change_endian_long(uint32_t data)
{
#if defined __LIT
    /* Casting is valid because it matches the type to the right side or argument. */
    return R_BSP_REVL(data);
#else
    return data;
#endif  /* defined __LIT */
}
/*********************************
 End of function change_endian_long
 **********************************/

#endif /* R_TSIP_RX_PRIVATE_HEADER_FILE */
